//API3ASS4 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//*
//STEP01   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=H
//ENTREE   DD   DSN=API3.COB.ASSURES2,DISP=(OLD,DELETE)
//SYSIN    DD   *
 REPRO IFILE(ENTREE) ODS(API3.COBOL.ASSURES3) REPLACE
/*


