//API3ASS4 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//*
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=H
//SYSIN    DD   *
  DELETE      API3.COBOL.ASSURES4
  DEF CL(NAME(API3.COBOL.ASSURES4)   -
      MODEL  (API3.ACTIF.FICH1))
//*



