//API3ASS3 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//*
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=H
//SYSIN    DD   *
  DEF CL(NAME(API3.COB.ASSURES3)   -
      MODEL  (API3.ACTIF.FICH1))
/*


