//API3ASS2 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//         JCLLIB ORDER=&SYSUID..SOURCE.JCL
//*
//*
//STEP01    EXEC PGM=SORT
//SYSOUT    DD SYSOUT=H
//SORTIN    DD DSN=API3.COB.ASSURES,DISP=SHR
//SORTOUT   DD DSN=API3.COB.ASSURES2,DISP=(NEW,CATLG)? 
//             SPACE=(TRK,(1,1)),LRECL=80,BLKSIZE=800,RECFM=(FB)
//SYSIN     DD *
  SORT FIELDS=(1,6,CH,A)    
  OMIT COND=(1,6,CH,EQ,C'999999')
/*
