//API3B JOB NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H
//*
//PROCLIB  JCLLIB ORDER=SDJ.FORM.PROCLIB
//*
//         SET SYSUID=API3,
//             NOMPGM=SMESSERR
//*
//APPROC   EXEC COMPDB2
//STEPDB2.SYSLIB   DD DSN=API3.SOURCE.DCLGEN,DISP=SHR
//                 DD DSN=API3.SOURCE.COPY,DISP=SHR
//STEPDB2.SYSIN    DD DSN=API3.SOURCE.DB2(&NOMPGM),DISP=SHR
//STEPDB2.DBRMLIB  DD DSN=API3.SOURCE.DBRMLIB(&NOMPGM),DISP=SHR
//STEPLNK.SYSLMOD  DD DSN=API3.SOURCE.PGMLIB(&NOMPGM),DISP=SHR
//*
//BIND     EXEC PGM=IKJEFT01,COND=(4,LT)
//*DBRMLIB  DD  DSN=&SYSUID..DB2.DBRMLIB,DISP=SHR
//DBRMLIB  DD  DSN=API3.SOURCE.DBRMLIB,DISP=SHR
//SYSTSPRT DD  SYSOUT=*,OUTLIM=25000
//SYSTSIN  DD  *
  DSN SYSTEM (DSN1)
  BIND PLAN      (SMESSERR) -
       QUALIFIER (API3)     -
       ACTION    (REPLACE) -
       MEMBER    (SMESSERR) -
       VALIDATE  (BIND)    -
       ISOLATION (CS)      -
       ACQUIRE   (USE)     -
       RELEASE   (COMMIT)  -
       EXPLAIN   (NO)
//*


